TakiTyler/NIMBL-SparkFun_MAX32664_Library/sensor-library.cpp
    writeRegisterMAX30101(CONFIGURATION_REGISTER, regVal);

    return SFE_BIO_SUCCESS;
}

uint16_t SparkFun_Bio_Sensor_Hub::readPulseWidth()
{
    uint8_t regVal = readRegisterMAX30101(CONFIGURATION_REGISTER);
    regVal &= READ_PULSE_MASK;

    if (regVal == 0)
    {
        return 69;
    }
    else if (regVal == 1)
    {
        return 118;
    }
    else if (regVal == 2)
    {
        return 215;
    }
    else if (regVal == 3)
    {
        return 411;
    }
    else
    {
        return ERR_UNKNOWN;
    }
}

uint8_t SparkFun_Bio_Sensor_Hub::getMcuType()
{
    return readByte(IDENTITY, READ_MCU_TYPE, NO_WRITE);
}

uint8_t SparkFun_Bio_Sensor_Hub::max30101Control(uint8_t enable)
{
    return writeByte(ENABLE_SENSOR, 0x03, enable);
}

uint8_t SparkFun_Bio_Sensor_Hub::readMAX30101State()
{
    return readByte(READ_SENSOR_MODE, READ_ENABLE_MAX30101);
}

uint8_t SparkFun_Bio_Sensor_Hub::setOutputMode(uint8_t outputType)
{
    return writeByte(OUTPUT_MODE, 0x00, outputType);
}

uint8_t SparkFun_Bio_Sensor_Hub::setFifoThreshold(uint8_t threshold)
{
    return writeByte(OUTPUT_MODE, 0x01, threshold);
}

uint8_t SparkFun_Bio_Sensor_Hub::numSamplesOutFifo()
{
    return readByte(READ_DATA_OUTPUT, NUM_SAMPLES);
}

uint8_t *SparkFun_Bio_Sensor_Hub::getDataOutFifo(uint8_t data[])
{
    uint8_t samples = numSamplesOutFifo();
    readFillArray(READ_DATA_OUTPUT, READ_DATA, samples, data);
    return data;
}

uint8_t SparkFun_Bio_Sensor_Hub::numSamplesExternalSensor()
{
    return readByte(READ_DATA_INPUT, SAMPLE_SIZE, WRITE_ACCELEROMETER);
}

void SparkFun_Bio_Sensor_Hub::writeRegisterMAX30101(uint8_t regAddr, uint8_t regVal)
{
    writeByte(WRITE_REGISTER, WRITE_MAX30101, regAddr, regVal);
}

void SparkFun_Bio_Sensor_Hub::writeRegisterAccel(uint8_t regAddr, uint8_t regVal)
{
    writeByte(WRITE_REGISTER, WRITE_ACCELEROMETER, regAddr, regVal);
}

uint8_t SparkFun_Bio_Sensor_Hub::readRegisterMAX30101(uint8_t regAddr)
{
    return readByte(READ_REGISTER, READ_MAX30101, regAddr);
}

uint8_t SparkFun_Bio_Sensor_Hub::readAlgoSamples()
{
    return readByte(READ_ALGORITHM_CONFIG, 0x00, 0x03);
}

uint8_t SparkFun_Bio_Sensor_Hub::agcAlgoControl(uint8_t enable)
{
    return writeByte(ENABLE_ALGORITHM, 0x00, enable);
}

uint8_t SparkFun_Bio_Sensor_Hub::maximFastAlgoControl(uint8_t mode)
{
    return writeByte(ENABLE_ALGORITHM, 0x02, mode);
}

uint8_t SparkFun_Bio_Sensor_Hub::writeByte(uint8_t _familyByte, uint8_t _indexByte, uint8_t _writeByte)
{
    uint8_t statusByte = 0xFF;

    // write the command
    UCB0I2CSA = this->_address;
    UCB0CTLW0 |= UCTR | UCTXSTT;

    while (!(UCB0IFG & UCTXIFG))
        ;
    UCB0TXBUF = _familyByte;

    while (!(UCB0IFG & UCTXIFG))
        ;
    UCB0TXBUF = _indexByte;

    while (!(UCB0IFG & UCTXIFG))
        ;
    UCB0TXBUF = _writeByte;

    while (UCB0CTLW0 & UCTXSTT)
        ;
    UCB0CTLW0 |= UCTXSTP;
    while (UCB0CTLW0 & UCTXSTP)
        ;

    __delay_cycles(2000); // 2ms delay @ 1MHz

    // read back the single status byte
    UCB0CTLW0 &= ~UCTR;
    UCB0CTLW0 |= UCTXSTT;
    UCB0CTLW0 |= UCTXSTP; // set stop

    while (!(UCB0IFG & UCRXIFG))
        ;
    statusByte = UCB0RXBUF;

    while (UCB0CTLW0 & UCTXSTP)
        ;

    return statusByte;
}

uint8_t SparkFun_Bio_Sensor_Hub::writeByte(uint8_t _familyByte, uint8_t _indexByte, uint8_t _writeByte, uint8_t _writeByteTwo)
{
    uint8_t statusByte = 0xFF;

    // write sequence: family + index + data1 + data2
    UCB0I2CSA = this->_address;
    UCB0CTLW0 |= UCTR | UCTXSTT;

    while (!(UCB0IFG & UCTXIFG))
        ;
    UCB0TXBUF = _familyByte;

    while (!(UCB0IFG & UCTXIFG))
        ;
    UCB0TXBUF = _indexByte;

    while (!(UCB0IFG & UCTXIFG))
        ;
    UCB0TXBUF = _writeByte;

    while (!(UCB0IFG & UCTXIFG))
        ;
    UCB0TXBUF = _writeByteTwo;

    while (UCB0CTLW0 & UCTXSTT)
        ;
    UCB0CTLW0 |= UCTXSTP;
    while (UCB0CTLW0 & UCTXSTP)
        ;

    __delay_cycles(2000); // 2ms delay @ 1MHz

    // read status bytes
    UCB0CTLW0 &= ~UCTR;
    UCB0CTLW0 |= UCTXSTT;
    UCB0CTLW0 |= UCTXSTP; // set stop

    while (!(UCB0IFG & UCRXIFG))
        ;
    statusByte = UCB0RXBUF;

    while (UCB0CTLW0 & UCTXSTP)
        ;

    return statusByte;
}

uint8_t SparkFun_Bio_Sensor_Hub::writeByte(uint8_t _familyByte, uint8_t _indexByte, uint8_t _writeByte, uint16_t _val)
{
    uint8_t statusByte = 0xFF;

    UCB0I2CSA = this->_address;
    UCB0CTLW0 |= UCTR | UCTXSTT;

    while (!(UCB0IFG & UCTXIFG))
        ;
    UCB0TXBUF = _familyByte;

    while (!(UCB0IFG & UCTXIFG))
        ;
    UCB0TXBUF = _indexByte;

    while (!(UCB0IFG & UCTXIFG))
        ;
    UCB0TXBUF = _writeByte;

    // split the 16-bit value into two 8-bit chunks
    while (!(UCB0IFG & UCTXIFG))
        ;
    UCB0TXBUF = (uint8_t)(_val >> 8); // MSB
    while (!(UCB0IFG & UCTXIFG))
        ;
    UCB0TXBUF = (uint8_t)(_val & 0xFF); // LSB

    while (UCB0CTLW0 & UCTXSTT)
        ;
    UCB0CTLW0 |= UCTXSTP;
    while (UCB0CTLW0 & UCTXSTP)
        ;

    __delay_cycles(2000); // 2ms delay @ 1MHz

    // read status bytes
    UCB0CTLW0 &= ~UCTR;
    UCB0CTLW0 |= UCTXSTT;
    UCB0CTLW0 |= UCTXSTP; // set stop

    while (!(UCB0IFG & UCRXIFG))
        ;
    statusByte = UCB0RXBUF;

    return statusByte;
}

uint8_t SparkFun_Bio_Sensor_Hub::writeLongBytes(uint8_t _familyByte, uint8_t _indexByte, uint8_t _writeByte, int32_t _writeVal[], const size_t _len)
{
    uint8_t statusByte = 0xFF;

    UCB0I2CSA = this->_address;
    UCB0CTLW0 |= UCTR | UCTXSTT;

    while (!(UCB0IFG & UCTXIFG))
        ;
    UCB0TXBUF = _familyByte;

    while (!(UCB0IFG & UCTXIFG))
        ;
    UCB0TXBUF = _indexByte;

    while (!(UCB0IFG & UCTXIFG))
        ;
    UCB0TXBUF = _writeByte;

    for (size_t i = 0; i < _len; i++)
    {
        for (uint8_t shift = 24; shift >= 0; shift -= 8)
        {
            while (!(UCB0IFG & UCTXIFG))
                ;
            UCB0TXBUF = (uint8_t)(_writeVal[i] >> shift);
        }
    }

    while (UCB0CTLW0 & UCTXSTT)
        ;
    UCB0CTLW0 |= UCTXSTP;
    while (UCB0CTLW0 & UCTXSTP)
        ;

    __delay_cycles(2000); // 2ms delay @ 1MHz

    // read status bytes
    UCB0CTLW0 &= ~UCTR;
    UCB0CTLW0 |= UCTXSTT;
    UCB0CTLW0 |= UCTXSTP; // set stop

