TakiTyler/NIMBL-SparkFun_MAX32664_Library/sensor-library.cpp
    // check for an error
    if (statusByte != SFE_BIO_SUCCESS)
    {
        UCB0CTLW0 |= UCTXSTP;
        return statusByte;
    }

    for (size_t i = 0; i < _len; i++)
    {
        if (i == (_len - 1))
        {
            UCB0CTLW0 |= UCTXSTP; // stop before last byte
        }
        while (!(UCB0IFG & UCRXIFG))
            ;
        userArray[i] = UCB0RXBUF;
    }

    return statusByte;
}

uint8_t SparkFun_Bio_Sensor_Hub::readMultipleBytes(uint8_t _familyByte, uint8_t _indexByte, uint8_t _writeByte, const size_t _len, int32_t userArray[])
{
    uint8_t statusByte = 0xFF;

    // write the three bytes
    UCB0I2CSA = this->_address;
    UCB0CTLW0 = UCTR | UCTXSTT;

    while (!(UCB0IFG & UCTXIFG))
        ;
    UCB0TXBUF = _familyByte;

    while (!(UCB0IFG & UCTXIFG))
        ;
    UCB0TXBUF = _indexByte;

    while (!(UCB0IFG & UCTXIFG))
        ;
    UCB0TXBUF = _writeByte;

    while (UCB0CTLW0 & UCTXSTT)
        ;                 // wait for start bit to clear
    UCB0CTLW0 |= UCTXSTP; // generate stop condition
    while (UCB0CTLW0 & UCTXSTP)
        ; // wait for stop to finish

    __delay_cycles(2000); // 2ms delay @ 1MHz

    // read the status + data
    UCB0CTLW0 &= ~UCTR;   // receiver mode
    UCB0CTLW0 |= UCTXSTT; // start condition

    // read status byte
    while (!(UCB0IFG & UCTXIFG))
        ; // wait until interrupt
    statusByte = UCB0RXBUF;

    // check for an error
    if (statusByte != SFE_BIO_SUCCESS)
    {
        UCB0CTLW0 |= UCTXSTP;
        return statusByte;
    }

    // each 32-bit int is sent as 4 bytes big-endian
    for (size_t i = 0; i < _len; i++)
    {
        userArray[i] = 0;
        for (uint8_t j = 0; j < 4; j++)
        {
            // check if its the last byte
            if (i == (_len - 1) && j == 3)
            {
                UCB0CTLW0 |= UCTXSTP;
            }
            while (!(UCB0IFG & UCRXIFG))
                ;
            userArray[i] = (userArray[i] << 8) | UCB0RXBUF;
        }
    }

    return statusByte;
}

uint8_t SparkFun_Bio_Sensor_Hub::readFillArray(uint8_t _familyByte, uint8_t _indexByte, uint8_t arraySize, uint8_t array[])
{

    // write request
    UCB0I2CSA = this->_address;
    UCB0CTLW0 |= UCTR | UCTXSTT;
    while (!(UCB0IFG & UCTXIFG))
        ;
    UCB0TXBUF = _familyByte;
    while (!(UCB0IFG & UCTXIFG))
        ;
    UCB0TXBUF = _indexByte;
    while (UCB0CTLW0 & UCTXSTT)
        ;
    UCB0CTLW0 |= UCTXSTP;
    while (UCB0CTLW0 & UCTXSTP)
        ;

    __delay_cycles(2000); // 2ms delay @ 1MHz

    // read response
    UCB0CTLW0 &= ~UCTR;
    UCB0CTLW0 |= UCTXSTT;

    while (!(UCB0IFG & UCRXIFG))
        ;
    uint8_t statusByte = UCB0RXBUF; // first byte is always status

    if (statusByte != SFE_BIO_SUCCESS)
    {
        UCB0CTLW0 |= UCTXSTP;
        return statusByte;
    }

    for (uint8_t i = 0; i < arraySize; i++)
    {
        if (i == (arraySize - 1))
        {
            UCB0CTLW0 |= UCTXSTP;
        }
        while (!(UCB0IFG & UCRXIFG))
            ;
        array[i] = UCB0RXBUF;
    }

    return statusByte;
}

// creating UART for debugging since printing doesn't seem to work
void initUART()
{
    // configure uart pins, 1.4 = TX & 1.5 = RX
    P1SEL0 |= BIT4 | BIT5;
    //    P1SEL0 &= ~(BIT4 | BIT5);

    // configure uart for 9600 baud
    UCA0CTLW0 |= UCSWRST;       // eUSCI in reset
    UCA0CTLW0 |= UCSSEL__SMCLK; // choose smclk

    UCA0BR0 = 104;
    UCA0BR1 = 0x00;
    UCA0MCTLW = 0x1100;

    UCA0CTLW0 &= ~UCSWRST; // release from reset
}

void uart_write_char(char c)
{
    while (!(UCA0IFG & UCTXIFG))
        ; // wait for tx buffer to be empty
    UCA0TXBUF = c;
}

void uart_write_string(const char *str)
{
    while (*str)
    {
        uart_write_char(*str++);
    }
}

void uart_write_int(int num)
{
    char buf[10];
    int i = 0;
    if (num == 0)
    {
        uart_write_char('0');
        return;
    }
    while (num > 0 && i < 10)
    {
        buf[i++] = (num % 10) + '0';
        num /= 10;
    }
    while (--i >= 0)
    {
        uart_write_char(buf[i]);
    }
}

int main(void)
{

    // stop watchdog timer
    WDTCTL = WDTPW | WDTHOLD;

    // disable gpio
    PM5CTL0 &= ~LOCKLPM5;

    P1DIR |= BIT0; // Set P1.0 to output direction
    P1OUT |= BIT0; // Turn on the LED

    initUART();

    bioData mySensorData;
    version firmwareVersion;

    mySensorData.heartRate = 72;
    mySensorData.confidence = 98;
    mySensorData.oxygen = 99;

    firmwareVersion.major = 1;
    firmwareVersion.minor = 0;
    firmwareVersion.revision = 3;

    uart_write_string("--- Sensor Test ---\n");

    uart_write_string("Heart Rate: ");
    uart_write_int((int)mySensorData.heartRate);
    uart_write_string(" bpm\n");

    uart_write_string("Oxygen: ");
    uart_write_int((int)mySensorData.oxygen);
    uart_write_string("%%\n");

    uart_write_string("Firmware: v");
    uart_write_int((int)firmwareVersion.major);
    uart_write_string(".");
    uart_write_int((int)firmwareVersion.minor);
    uart_write_string(".");
    uart_write_int((int)firmwareVersion.revision);
    uart_write_string("\n");
    P1OUT &= ~BIT0; // Turn on the LED

    //    printf("--- Sensor Test ---\n");
    //    printf("Heart Rate: %d bpm\n", (int) mySensorData.heartRate);
    //    printf("Oxygen: %d%%\n", (int) mySensorData.oxygen);
    //    printf("Firmware: v%d.%d.%d\n", (int) firmwareVersion.major, (int) firmwareVersion.minor, (int) firmwareVersion.revision);

    while (1)
        ;
}
